### Intro
This is a Python notebook to explain and try out more advanced Python SQL interactions

In [5]:
#1. commands beginning with '%' are sent to the terminal (Cool!)
#2. ipython-sql allows you to specify sql commands in-line (not as strings) by using '%' or '%%' (see below)
%pip install ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in /home/rambino/.local/lib/python3.10/site-packages (0.4.1)
Requirement already satisfied: six in /usr/lib/python3/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in /home/rambino/.local/lib/python3.10/site-packages (from ipython-sql) (8.4.0)
Requirement already satisfied: sqlparse in /home/rambino/.local/lib/python3.10/site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: prettytable<1 in /home/rambino/.local/lib/python3.10/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/rambino/.local/lib/python3.10/site-packages (from ipython-sql) (1.4.39)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/rambino/.local/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: backcall in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.16 in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (3.0.30)
Requirement already satisfied: stack-data in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.3.0)
Requirement already satisfied: pygments>=2.4.0 in /usr/lib/python3/dist-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: setuptools>=18.5 in /usr/lib/python3/dist-packages (from ipython>=1.0->ipython-sql) (59.6.0)
Requirement already satisfied: decorator in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: traitlets>=5 in /home/rambino/.local/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (5.3.0)
Requirement already satisfied: pexpect>4.3 in /usr/lib/python3/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /home/rambino/.local/lib/python3.10/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /home/rambino/.local/lib/python3.10/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in /home/rambino/.local/lib/python3.10/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: executing in /home/rambino/.local/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in /home/rambino/.local/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in /home/rambino/.local/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Note: you may need to restart the kernel to use updated packages.

In [1]:
#The percent operator allows you to load extensions to make the Python shell interpret commands differently.
#More info: https://ipython.readthedocs.io/en/stable/config/extensions/index.html
%load_ext sql

In [2]:
# Note: port 5432 is the default used by postgres

db_host = '127.0.0.1'
db = 'pagila'
db_user = 'basic_user'
db_password = 'password'
db_port = '5432'

connection = f'postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db}'
print(connection)

postgresql://basic_user:password@127.0.0.1:5432/pagila

In [11]:
#Connecting to Database
%sql $connection

In [14]:
'''
Notes on '%' operator when using sql commands:
1. Each command preceded by '%' will be interpreted by the terminal
2. You can use '$' to insert Python variables into these single-line commands
3. You can also write multi-line commands with '%%', but these do not support inserting Python variables with '$'
'''
%sql SELECT * FROM store;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 9, 57, 12)),
 (2, 2, 2, datetime.datetime(2006, 2, 15, 9, 57, 12))]

In [34]:
# Showing an overview of how much data we have:

#%sql SELECT * FROM information_schema.tables WHERE table_schema = 'public';
tables = ['film','store','customer','rental','payment','staff','city','country']
for tbl in tables:
    data = %sql SELECT COUNT(*) FROM $tbl;
    print(f'{tbl}\t' + str(data[0][0]))

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
film	1000
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
store	2
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
customer	599
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
rental	16044
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
payment	32098
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
staff	2
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
city	600
 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.
country	109

In [35]:
#Get range of all payment dates:
%%sql
SELECT min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2007, 1, 24, 21, 21, 56, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

#### See all districts where customers are living

In [40]:
%%sql
SELECT district, SUM(city_id) as count
FROM address
GROUP BY district
ORDER BY count DESC
LIMIT 20;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
20 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790),
 ('Guangdong', 1740),
 ('Punjab', 1706),
 ('Inner Mongolia', 1580),
 ('Henan', 1534),
 ('Maharashtra', 1488),
 ('Central Java', 1444),
 ('Liaoning', 1366),
 ('Gauteng', 1317),
 ('Karnataka', 1303),
 ('Central Luzon', 1239)]

#### What are the top-grossing movies in this database?
So what are the movies which, in aggregate, have earned the most money?

In [54]:
%%sql
SELECT SUM(payment.amount) as income, film.film_id, film.title
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY film.film_id, film.title
ORDER BY income DESC
LIMIT 20;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
20 rows affected.

[(Decimal('463.46'), 879, 'TELEGRAPH VOYAGE'),
 (Decimal('447.38'), 973, 'WIFE TURN'),
 (Decimal('429.38'), 1000, 'ZORRO ARK'),
 (Decimal('419.38'), 369, 'GOODFELLAS SALUTE'),
 (Decimal('409.44'), 764, 'SATURDAY LAMBS'),
 (Decimal('403.42'), 893, 'TITANS JERK'),
 (Decimal('397.44'), 897, 'TORQUE BOUND'),
 (Decimal('391.40'), 403, 'HARRY IDAHO'),
 (Decimal('383.48'), 460, 'INNOCENT USUAL'),
 (Decimal('381.56'), 444, 'HUSTLER PARTY'),
 (Decimal('377.48'), 670, 'PELICAN COMFORTS'),
 (Decimal('363.40'), 127, 'CAT CONEHEADS'),
 (Decimal('361.42'), 284, 'ENEMY ODDS'),
 (Decimal('361.32'), 103, 'BUCKET BROTHERHOOD'),
 (Decimal('359.46'), 715, 'RANGE MOONWALKER'),
 (Decimal('359.40'), 563, 'MASSACRE USUAL'),
 (Decimal('357.42'), 941, 'VIDEOTAPE ARSENIC'),
 (Decimal('357.40'), 239, 'DOGMA FAMILY'),
 (Decimal('357.38'), 31, 'APACHE DIVINE'),
 (Decimal('355.48'), 938, 'VELVET TERMINATOR')]

#### What are the cities whose customers provide the most income in this database?
So what are the cities where customers live which, when aggregated, have paid the most?

In [58]:
%%sql
SELECT SUM(payment.amount) as income, city.city_id, city.city
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city on address.city_id = city.city_id
GROUP BY city.city_id, city.city
ORDER BY income DESC
LIMIT 10;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
10 rows affected.

[(Decimal('443.10'), 101, 'Cape Coral'),
 (Decimal('433.08'), 442, 'Saint-Denis'),
 (Decimal('397.00'), 42, 'Aurora'),
 (Decimal('391.16'), 340, 'Molodetno'),
 (Decimal('389.22'), 29, 'Apeldoorn'),
 (Decimal('389.22'), 456, 'Santa Brbara dOeste'),
 (Decimal('373.24'), 423, 'Qomsheh'),
 (Decimal('361.04'), 312, 'London'),
 (Decimal('355.20'), 388, 'Ourense (Orense)'),
 (Decimal('351.22'), 78, 'Bijapur')]

#### Revenue of Movie by Customer City and by Month

In [72]:
%%sql
SELECT film.title, 
    SUM(payment.amount) AS income,
    city.city,
    EXTRACT(month FROM payment.payment_date) as month
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city on address.city_id = city.city_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY city.city, month, film.title
ORDER BY month, income DESC
LIMIT 10;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
10 rows affected.

[('SHOW LORD', Decimal('23.98'), 'Mannheim', Decimal('1')),
 ('AMERICAN CIRCUS', Decimal('21.98'), 'Callao', Decimal('1')),
 ('KISSING DOLLS', Decimal('21.98'), 'Toulon', Decimal('1')),
 ('CASUALTIES ENCINO', Decimal('21.98'), 'Warren', Decimal('1')),
 ('TELEGRAPH VOYAGE', Decimal('21.98'), 'Naala-Porto', Decimal('1')),
 ('MOONSHINE CABIN', Decimal('19.98'), 'Balaiha', Decimal('1')),
 ('MILLION ACE', Decimal('19.98'), 'Bergamo', Decimal('1')),
 ('DARKO DORADO', Decimal('19.98'), 'Bhilwara', Decimal('1')),
 ('MINE TITANS', Decimal('19.98'), 'Bradford', Decimal('1')),
 ('AUTUMN CROW', Decimal('19.98'), 'Ashgabat', Decimal('1'))]